In [181]:
import pandas as pd

In [182]:
df = pd.read_csv('bank-full.csv')

<h2>Data Understanding and Preprocessing</h2>

In [183]:
df.head(5) #how data looks like

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [184]:
df.shape #how much data we have

(45211, 17)

In [185]:
df.isnull().any() # is any tuple having null value

age          False
job          False
marital      False
education    False
default      False
balance      False
housing      False
loan         False
contact      False
day          False
month        False
duration     False
campaign     False
pdays        False
previous     False
poutcome     False
y            False
dtype: bool

In [186]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
age          45211 non-null int64
job          45211 non-null object
marital      45211 non-null object
education    45211 non-null object
default      45211 non-null object
balance      45211 non-null int64
housing      45211 non-null object
loan         45211 non-null object
contact      45211 non-null object
day          45211 non-null int64
month        45211 non-null object
duration     45211 non-null int64
campaign     45211 non-null int64
pdays        45211 non-null int64
previous     45211 non-null int64
poutcome     45211 non-null object
y            45211 non-null object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

In [187]:
#dropping columns  
df = df.drop(['contact','day','month','duration','campaign','pdays','previous','poutcome','y'],axis=1)

In [188]:
df.head(5) #check out after

   age           job  marital  education default  balance housing loan
0   58    management  married   tertiary      no     2143     yes   no
1   44    technician   single  secondary      no       29     yes   no
2   33  entrepreneur  married  secondary      no        2     yes  yes
3   47   blue-collar  married    unknown      no     1506     yes   no
4   33       unknown   single    unknown      no        1      no   no

In [189]:
df1 = df
df.shape

(45211, 8)

In [190]:
#creating groups of age
a=set(df['age'])
print(a)

{18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 92, 93, 94, 95}

In [191]:
b=set(df['job'])
print(b)

{'management', 'entrepreneur', 'blue-collar', 'technician', 'services', 'self-employed', 'admin.', 'unemployed', 'housemaid', 'unknown', 'retired', 'student'}

In [192]:
c=set(df['marital'])
print(c)

{'single', 'married', 'divorced'}

In [193]:
d=set(df['education'])
print(d)

{'unknown', 'secondary', 'primary', 'tertiary'}

<h2>Making groups of age</h2><br>
<ul>
    <li>'age' < 30      --> 'Group1' --> '1'</li>
    <li>30 < 'age' < 40 --> 'Group2' --> '2'</li>
    <li>'age' > 40      --> 'Group3' --> '3'</li>
</ul>

In [194]:
df1.head(5)

   age           job  marital  education default  balance housing loan
0   58    management  married   tertiary      no     2143     yes   no
1   44    technician   single  secondary      no       29     yes   no
2   33  entrepreneur  married  secondary      no        2     yes  yes
3   47   blue-collar  married    unknown      no     1506     yes   no
4   33       unknown   single    unknown      no        1      no   no

In [195]:
df2=df.sort_values(by=['age'])

In [196]:
df2.head(10)

       age      job marital  education default  balance housing loan
42954   18  student  single    unknown      no      108      no   no
41273   18  student  single    unknown      no        3      no   no
42146   18  student  single  secondary      no      156      no   no
43637   18  student  single    unknown      no      348      no   no
40736   18  student  single    primary      no     1944      no   no
40887   18  student  single    primary      no      608      no   no
42274   18  student  single    primary      no      608      no   no
41222   18  student  single    unknown      no       35      no   no
41487   18  student  single    unknown      no      108      no   no
41252   18  student  single  secondary      no        5      no   no

In [ ]:
j = 0
k = df2.age
for i in range(len(k)):
    if(i <= 30):
        df2.age[j]='<30'
    else:
        if(i <= 50):
            df2.age[j]='31..50'
        else:
            df2.age[j]='>50'
    j+=1

C:\Users\Rahul\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """
C:\Users\Rahul\Anaconda3\lib\site-packages\pandas\core\indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)
C:\Users\Rahul\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\Rahul\Anaconda3\lib\site-packages\ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  # Remove the CWD from sys.path while we load stuff.

In [ ]:
df2